In [56]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series
import sqlite3 as db

## Problem Statement

Read the following data set:
https://archive.ics.uci.edu/ml/machine-learning-databases/adult/

In [57]:
df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data')

In [58]:
df.head()

,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

## Rename Columns

Rename the columns as per the description from this file:
https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.names

In [59]:
df.columns

Index(['39', ' State-gov', ' 77516', ' Bachelors', ' 13', ' Never-married',
       ' Adm-clerical', ' Not-in-family', ' White', ' Male', ' 2174', ' 0',
       ' 40', ' United-States', ' <=50K'],
      dtype='object')

In [60]:
new_column_names = {'39':'age',' State-gov':'workclass',' 77516':'fnlwgt',
                    ' Bachelors':'education',' 13':'educationnum',' Never-married':'maritalstatus',
                    ' Adm-clerical':'occupation',' Not-in-family':'relationship',' White':'race',' Male':'sex',
                    ' 2174':'capitalgain',' 0':'capitalloss',' 40':'hoursperweek',
                    ' United-States':'nativecountry',' <=50K':'income' }

In [61]:
df.rename(columns = new_column_names, inplace = True)

In [62]:
df.head()

,age,workclass,fnlwgt,education,educationnum,maritalstatus,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,nativecountry,income
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [63]:
df.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'educationnum',
       'maritalstatus', 'occupation', 'relationship', 'race', 'sex',
       'capitalgain', 'capitalloss', 'hoursperweek', 'nativecountry',
       'income'],
      dtype='object')

## Create dB

Create a sql db from adult dataset and name it sqladb

In [64]:
conn = db.connect('sqladb.db')
cursor = conn.cursor()

In [23]:
df.to_sql(name="adultdata", con=conn, if_exists="append", index=False)

In [65]:
conn.commit

## Problem 1

Select 10 records from the adult sqladb

In [67]:
sql1 = ("SELECT * FROM adultdata LIMIT 10")
result = pd.read_sql_query(sql1, conn)

In [68]:
print(result)

   age          workclass  fnlwgt      education  educationnum  \
0   50   Self-emp-not-inc   83311      Bachelors            13
1   38            Private  215646        HS-grad             9
2   53            Private  234721           11th             7
3   28            Private  338409      Bachelors            13
4   37            Private  284582        Masters            14
5   49            Private  160187            9th             5
6   52   Self-emp-not-inc  209642        HS-grad             9
7   31            Private   45781        Masters            14
8   42            Private  159449      Bachelors            13
9   37            Private  280464   Some-college            10

            maritalstatus          occupation    relationship    race  \
0      Married-civ-spouse     Exec-managerial         Husband   White
1                Divorced   Handlers-cleaners   Not-in-family   White
2      Married-civ-spouse   Handlers-cleaners         Husband   Black
3      Married-civ-spouse      Prof-specialty            Wife   Black
4      Married-civ-spouse     Exec-managerial            Wife   White
5   Married-spouse-absent       Other-service   Not-in-family   Black
6      Married-civ-spouse     Exec-managerial         Husband   White
7           Never-married      Prof-specialty   Not-in-family   White
8      Married-civ-spouse     Exec-managerial         Husband   White
9      Married-civ-spouse     Exec-managerial         Husband   Black

       sex  capitalgain  capitalloss  hoursperweek   nativecountry  income
0     Male            0            0            13   United-States   <=50K
1     Male            0            0            40   United-States   <=50K
2     Male            0            0            40   United-States   <=50K
3   Female            0            0            40            Cuba   <=50K
4   Female            0            0            40   United-States   <=50K
5   Female            0            0            16         Jamaica   <=50K
6     Male            0            0            45   United-States    >50K
7   Female        14084            0            50   United-States    >50K
8     Male         5178            0            40   United-States    >50K
9     Male            0            0            80   United-States    >50K

## Problem 2

Show me the average hours per week of all men who are working in private sector

In [108]:
sql2 = ("SELECT avg(hoursperweek) as avg_hours_per_week FROM adultdata WHERE workclass = ' Private' and sex = ' Male' ")
avg_hours_per_week = pd.read_sql_query(sql2, conn)

In [109]:
print(avg_hours_per_week)

   avg_hours_per_week
0           42.221226

## Problem 3

Show me the frequency table for education, occupation and relationship, separately

In [110]:
sql3 = ("SELECT education , COUNT(education) as count FROM adultdata GROUP BY education ")
frequency_table_education = pd.read_sql_query(sql3, conn)

In [111]:
print(frequency_table_education)

        education  count
0            10th    933
1            11th   1175
2            12th    433
3         1st-4th    168
4         5th-6th    333
5         7th-8th    646
6             9th    514
7      Assoc-acdm   1067
8       Assoc-voc   1382
9       Bachelors   5354
10      Doctorate    413
11        HS-grad  10501
12        Masters   1723
13      Preschool     51
14    Prof-school    576
15   Some-college   7291

In [112]:
sql4 = ("SELECT occupation , COUNT(occupation) as count FROM adultdata GROUP BY occupation ")
frequency_table_occupation = pd.read_sql_query(sql4, conn)

In [113]:
print(frequency_table_occupation)

            occupation  count
0                    ?   1843
1         Adm-clerical   3769
2         Armed-Forces      9
3         Craft-repair   4099
4      Exec-managerial   4066
5      Farming-fishing    994
6    Handlers-cleaners   1370
7    Machine-op-inspct   2002
8        Other-service   3295
9      Priv-house-serv    149
10      Prof-specialty   4140
11     Protective-serv    649
12               Sales   3650
13        Tech-support    928
14    Transport-moving   1597

In [114]:
sql5 = ("SELECT relationship , COUNT(relationship) as count FROM adultdata GROUP BY relationship ")
frequency_table_relationship = pd.read_sql_query(sql5, conn)

In [115]:
print(frequency_table_relationship)

      relationship  count
0          Husband  13193
1    Not-in-family   8304
2   Other-relative    981
3        Own-child   5068
4        Unmarried   3446
5             Wife   1568

## Problem 4

Are there any people who are married, working in private sector and having a masters
degree

In [45]:
sql6 = ("""
            SELECT maritalstatus, education, workclass, count(workclass) as count
            FROM adultdata WHERE maritalstatus IN (' Married-civ-spouse', ' Married-spouse-absent' , ' Married-AF-spouse')
            and education = ' Masters' and workclass = ' Private' GROUP BY maritalstatus """)
working_private_married = pd.read_sql_query(sql6, conn)

In [46]:
print(working_private_married)

            maritalstatus education workclass  count
0      Married-civ-spouse   Masters   Private    531
1   Married-spouse-absent   Masters   Private      9

## Problem 5

What is the average, minimum and maximum age group for people working in
different sectors

In [129]:
sql7 =  ("SELECT workclass as sector, AVG(age) as avg, MIN(age) as min, MAX(age) as max FROM adultdata GROUP BY workclass ")
avg_min_max_age_byworkclass = pd.read_sql_query(sql7,conn)

In [130]:
print(avg_min_max_age_byworkclass)

              sector        avg  min  max
0                  ?  40.960240   17   90
1        Federal-gov  42.590625   17   90
2          Local-gov  41.751075   17   90
3       Never-worked  20.571429   17   30
4            Private  36.797585   17   90
5       Self-emp-inc  46.017025   17   84
6   Self-emp-not-inc  44.969697   17   90
7          State-gov  39.436392   17   81
8        Without-pay  47.785714   19   72

## Problem 6

Calculate age distribution by country

In [75]:
sql8 = ("""
      SELECT nativecountry
,COUNT(CASE WHEN age BETWEEN 10 AND 19 THEN nativecountry ELSE NULL END) AS [10-19]
,COUNT(CASE WHEN age BETWEEN 20 AND 29 THEN nativecountry ELSE NULL END) AS [20-29]
,COUNT(CASE WHEN age BETWEEN 30 AND 39 THEN nativecountry ELSE NULL END) AS [30-39]
,COUNT(CASE WHEN age BETWEEN 40 AND 49 THEN nativecountry ELSE NULL END) AS [40-49]
,COUNT(CASE WHEN age BETWEEN 50 AND 59 THEN nativecountry ELSE NULL END) AS [50-59]
,COUNT(CASE WHEN age BETWEEN 60 AND 69 THEN nativecountry ELSE NULL END) AS [60-69]
,COUNT(CASE WHEN age BETWEEN 70 AND 79 THEN nativecountry ELSE NULL END) AS [70-79]
,COUNT(CASE WHEN age BETWEEN 80 AND 89 THEN nativecountry ELSE NULL END) AS [80-89]
,COUNT(CASE WHEN age BETWEEN 90 AND 100 THEN nativecountry ELSE NULL END) AS [90-100]
from adultdata
group by nativecountry""")

age_range_by_country =  pd.read_sql_query(sql8, conn)

In [76]:
print(age_range_by_country)

                  nativecountry  10-19  20-29  30-39  40-49  50-59  60-69  \
0                             ?     15    128    193    135     70     34
1                      Cambodia      1      4      6      5      2      1
2                        Canada      4     25     27     24     23     11
3                         China      0      9     24     21     12      7
4                      Columbia      1     17     15     12      8      5
5                          Cuba      0     11     24     22     24      9
6            Dominican-Republic      1     27     10     17     12      2
7                       Ecuador      0     12      7      6      1      1
8                   El-Salvador      6     43     24     18     12      2
9                       England      3     16     25     24     13      6
10                       France      0      7     11      5      4      2
11                      Germany      1     34     43     29     18     10
12                       Greece      0      5      2      8     12      2
13                    Guatemala      3     32     13     10      4      2
14                        Haiti      2     11     10     10     10      1
15           Holand-Netherlands      0      0      1      0      0      0
16                     Honduras      2      3      4      3      1      0
17                         Hong      1      7      8      3      0      1
18                      Hungary      0      3      1      2      3      3
19                        India      2     24     30     26     16      2
20                         Iran      0      5     20     11      5      2
21                      Ireland      0      5     11      4      3      1
22                        Italy      1      8     14     18     21     10
23                      Jamaica      2     30     22     14     11      2
24                        Japan      2     11     22     20      6      1
25                         Laos      2      6      4      3      3      0
26                       Mexico     26    261    188    103     52     11
27                    Nicaragua      2     12     11      6      2      1
28   Outlying-US(Guam-USVI-etc)      0      6      1      4      2      1
29                         Peru      3      9      6     11      0      2
30                  Philippines      5     49     61     42     25     12
31                       Poland      1     13     14     14     10      3
32                     Portugal      1      9     11      8      5      1
33                  Puerto-Rico      4     21     28     35     18      6
34                     Scotland      1      3      1      4      2      1
35                        South      3     22     20     16     11      6
36                       Taiwan      0     19     18     10      3      1
37                     Thailand      2      4      5      6      1      0
38              Trinadad&Tobago      1      1      6      7      3      1
39                United-States   1557   7111   7650   6442   3983   1850
40                      Vietnam      2     27     17     12      5      1
41                   Yugoslavia      0      4      4      5      2      1

    70-79  80-89  90-100
0       5      2       1
1       0      0       0
2       6      1       0
3       2      0       0
4       1      0       0
5       4      1       0
6       1      0       0
7       0      0       1
8       1      0       0
9       2      0       1
10      0      0       0
11      2      0       0
12      0      0       0
13      0      0       0
14      0      0       0
15      0      0       0
16      0      0       0
17      0      0       0
18      0      1       0
19      0      0       0
20      0      0       0
21      0      0       0
22      1      0       0
23      0      0       0
24      0      0       0
25      0      0       0
26      1      1       0
27      0      0       0
28      0      0       0
29      0      0       0
30      3      0       1
31      3      2       0
32      2      0       0
33      1      0       1
34      0      0       0
35      1      0       1
36      0      0       0
37      0      0       0
38      0      0       0
39    469     70      37
40      3      0       0
41      0      0       0

## Problem 7

Compute a new column as 'Net-Capital-Gain' from the two columns 'capital-gain' and
'capital-loss'

In [51]:
sql9 = ("  SELECT capitalgain - capitalloss AS 'Net-Capital_Gain' from adultdata ")
net_capital_gain = pd.read_sql_query(sql9, conn)

In [55]:
print((net_capital_gain).head(30))

    Net-Capital_Gain
0                  0
1                  0
2                  0
3                  0
4                  0
5                  0
6                  0
7              14084
8               5178
9                  0
10                 0
11                 0
12                 0
13                 0
14                 0
15                 0
16                 0
17                 0
18                 0
19                 0
20                 0
21                 0
22             -2042
23                 0
24                 0
25                 0
26                 0
27                 0
28                 0
29                 0